nxp-mcuxpresso/mcux-sdk/boards/evkmimxrt1040/project_template/pin_mux.h
/* GPIO_B1_09 (coord B13), ENET_TXEN/U18[23] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXEN_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TXEN_SIGNAL                           enet_tx_en   /*!< Signal name */

/* GPIO_B1_10 (coord C12), ENET_TX_REF_CLK/U18[9] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TX_REF_CLK_PERIPHERAL                       ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TX_REF_CLK_SIGNAL                   enet_ref_clk   /*!< Signal name */

/* GPIO_B1_11 (coord D12), ENET_RXER/U18[20] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXER_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_RXER_SIGNAL                           enet_rx_er   /*!< Signal name */

/* GPIO_EMC_40 (coord C7), ENET_MDC/U18[12] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_MDC_PERIPHERAL                              ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_MDC_SIGNAL                              enet_mdc   /*!< Signal name */

/* GPIO_EMC_41 (coord D6), ENET_MDIO/U18[11] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_MDIO_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_MDIO_SIGNAL                            enet_mdio   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENETPins(void);

/* GPIO_B1_14 (coord E13), SD0_VSELECT/J17[1] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD0_VSELECT_PERIPHERAL                        USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD0_VSELECT_SIGNAL                     usdhc_vselect   /*!< Signal name */

/* GPIO_SD_B0_00 (coord H3), J17[6]/U63[8] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_00_PERIPHERAL                      USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_00_SIGNAL                       usdhc_cmd   /*!< Signal name */

/* GPIO_SD_B0_01 (coord K3), J17[3]/U63[7] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_01_PERIPHERAL                      USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_01_SIGNAL                       usdhc_clk   /*!< Signal name */

/* GPIO_SD_B0_02 (coord J3), J17[4]/U64[8] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_02_PERIPHERAL                      USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_02_SIGNAL                      usdhc_data   /*!< Signal name */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_02_CHANNEL                             0U   /*!< Signal channel */

/* GPIO_SD_B0_03 (coord J2), J17[5]/U64[7] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_03_PERIPHERAL                      USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_03_SIGNAL                      usdhc_data   /*!< Signal name */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_03_CHANNEL                             1U   /*!< Signal channel */

/* GPIO_SD_B0_04 (coord J4), U65[8] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_04_PERIPHERAL                      USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_04_SIGNAL                      usdhc_data   /*!< Signal name */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_04_CHANNEL                             2U   /*!< Signal channel */

/* GPIO_SD_B0_05 (coord J1), U65[7] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_05_PERIPHERAL                      USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_05_SIGNAL                      usdhc_data   /*!< Signal name */
#define BOARD_INITUSDHCPINS_GPIO_SD_B0_05_CHANNEL                             3U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSDHCPins(void);

/* GPIO_SD_B1_05 (coord M4), FlexSPI_DQS */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_DQS_PERIPHERAL                        FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_DQS_SIGNAL                      FLEXSPI_A_DQS   /*!< Signal name */

/* GPIO_SD_B1_06 (coord M5), FlexSPI_SS0/U24[1] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_SS0_PERIPHERAL                        FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_SS0_SIGNAL                    FLEXSPI_A_SS0_B   /*!< Signal name */

/* GPIO_SD_B1_07 (coord L4), FlexSPI_CLK/U24[6] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_CLK_PERIPHERAL                        FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_CLK_SIGNAL                     FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_SD_B1_08 (coord N4), FlexSPI_D0_A/U24[5] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_D0_A_PERIPHERAL                       FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_D0_A_SIGNAL                   FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_SD_B1_09 (coord K6), FlexSPI_D1_A/U24[2] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_D1_A_PERIPHERAL                       FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_D1_A_SIGNAL                   FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_SD_B1_10 (coord N5), FlexSPI_D2_A/U24[3] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_D2_A_PERIPHERAL                       FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_D2_A_SIGNAL                   FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_SD_B1_11 (coord N6), FlexSPI_D3_A/U24[7] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_D3_A_PERIPHERAL                       FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_D3_A_SIGNAL                   FLEXSPI_A_DATA3   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPIPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
